           FD  NOTAS-FILE.
           01  REG-ALUNO.
               05 NOTAS-NUMBER         PIC 9(5).
               05 FILLER               PIC X     VALUE SPACE.
               05 NOMEALUNO            PIC X(20).
               05 FILLER               PIC X     VALUE SPACE.
               05 NOTA1                PIC 99V99.
               05 FILLER               PIC X     VALUE SPACE.
               05 NOTA2                PIC 99V99.
               05 FILLER               PIC X     VALUE SPACE.
               05 NOTA3                PIC 99V99.
               05 FILLER               PIC X     VALUE SPACE.
               05 MEDIAALUNO           PIC 99V99.
